#+TITLE: Configuration requiring external packages
#+PROPERTY: header-args :tangle yes :results silent :mkdirp yes

This is the subset of my emacs configuration files that require
external (non-emacs) packages. Contrast with [[file:vanilla-config.org]]
and (future) emacs-only packages sections.

** Capture invitations to calendar
:PROPERTIES:
:SOURCE:   https://github.com/asoroa/ical2org.py
:END:
Using =ical2org-py= to convert the file to org mode. 
Binding [[info:mu4e#Attachment%20actions][mu4e Attachment actions]] to define a key for it.
Install via pipsi in github repo. It's easiest.

#+BEGIN_SRC shell :results verbatim :tangle no
ical2orgpy --help
#+END_SRC

#+RESULTS:
#+begin_example
Usage: ical2orgpy [OPTIONS] ICS_FILE ORG_FILE

  Convert ICAL format into org-mode.

  Files can be set as explicit file name, or `-` for stdin or stdout::

      $ ical2orgpy in.ical out.org

      $ ical2orgpy in.ical - > out.org

      $ cat in.ical | ical2orgpy - out.org

      $ cat in.ical | ical2orgpy - - > out.org

Options:
  -p, --print-timezones     Print acceptable timezone names and exit.
  -d, --days INTEGER RANGE  Window length in days (left & right from current
                            time). Has to be positive.
  -t, --timezone TEXT       Timezone to use. (local timezone by default)
  -h, --help                Show this message and exit.
#+end_example

#+BEGIN_SRC emacs-lisp
(defun convert-to-org-calendar-attachment (msg attachnum)
  "Converts to org format an (ical) attachment"
  (mu4e-view-pipe-attachment msg attachnum "ical2orgpy - - >> ~/dev/notes/calendar.org"))

;; defining 'n' as the shortcut (if mu4e is loaded)
(when (featurep 'mu4e)
  (add-to-list 'mu4e-view-attachment-actions
	       '("cSave to calendar" . convert-to-org-calendar-attachment) t))
#+END_SRC
